{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv1D", "config": {"dilation_rate": [1], "filters": 16, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "dtype": null, "padding": "valid", "strides": [1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "use_bias": true, "kernel_size": [9], "trainable": true, "bias_constraint": null, "name": "conv1d"}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "dtype": null, "strides": [2], "trainable": true, "name": "max_pooling1d"}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "filters": 32, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "dtype": null, "padding": "valid", "strides": [1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "use_bias": true, "kernel_size": [9], "trainable": true, "bias_constraint": null, "name": "conv1d_1"}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "dtype": null, "strides": [2], "trainable": true, "name": "max_pooling1d_1"}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "filters": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "dtype": null, "padding": "valid", "strides": [1], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "use_bias": true, "kernel_size": [7], "trainable": true, "bias_constraint": null, "name": "conv1d_2"}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "pool_size": [2], "dtype": null, "strides": [2], "trainable": true, "name": "max_pooling1d_2"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "dtype": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1024, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "relu", "dtype": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1024, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "activation": "linear", "dtype": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 3, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_2"}}], "build_input_shape": [null, 924, 32], "name": "sequential"}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}